[
  {
    "Title": "BMW M5 Complete History - E28 to F90",
    "Url": "https://www.youtube.com/watch?v=2MYCeaQKJEA",
    "Description": "The BMW M5 has reigned as king of the super saloons for well over 3 decades now, with the latest F90 M5 Competition cementing its legendary status. In this special feature, Paul and Tiff look back at every generation of the BMW M5 ever produced starting in 1984, getting behind the wheel of the E28, E34, E39, E60, F10, and F90. They explore how the car has evolved over the years, from the original M1-engined car of the 1980s, to today\u0027s all wheel drive V8 monster. And of course, they couldn\u0027t help get the original M5 drifting and the M5 Competition drifting. "
  },
  {
    "Title": "The Untold Story: Audi quattro - DEVELOPMENT Documentary",
    "Url": "https://www.youtube.com/watch?v=H-vWtNeZJW0",
    "Description": "Audi\u0027s permanent all-wheel drive is characterized by excellent traction, high driving safety and superb driving dynamics. This makes quattro the brand\u0027s trump card. Audi quattro is allure, quattro is emotion.\nInside the Audi factory development. As it is done and car factory inside the Audi permanent all-wheel drive with quattro technology. Audi quattro. Here\u0027s the inside of the video\nAudi quattro: 40 years of quattro. Images from the 40th anniversary of the legendary all-wheel drive. The quattro permanent all-wheel drive was one of Audi\u0027s key technologies.\nAudi quattro hill climb test: To test the quattro drive, Audi recreates extreme hill climb situations at the Audi test site. William Waits, chassis development specialist, and Dieter Weidemann, Head of All-Wheel Drive Development, explain exactly how it works."
  },
  {
    "Title": "Exploring the Iconic Mercedes W124: A Journey Through Time and Performance",
    "Url": "https://www.youtube.com/watch?v=tOnDbKZV5GA",
    "Description": "Join us on a journey through automotive history as we explore the enduring performance and timeless appeal of the Mercedes W124. Known for its exceptional engineering and durability, the W124 remains a beloved classic among car enthusiasts. In this video, we dive into the features and innovations that have made the Mercedes W124 a benchmark for reliability and performance over the decades."
  },
  {
    "Title": "The Lexus LFA Was Not A Failure (Even Though It Was) — Revelations with Jason Cammisa",
    "Url": "https://www.youtube.com/watch?v=aBmNpDksfj4",
    "Description": "F is for Failure, and the Lexus LFA wasn\u0027t a marketplace success. However, it created Gazoo Racing, which today gives us the GR Corolla, GR Yaris, GR Supra, and GR86. So the LFA paid dividends where it matters most: to regular enthusiasts."
  },
  {
    "Title": "Nissan GTR History : Everything YOU need to know!",
    "Url": "https://www.youtube.com/watch?v=wmvwj_BqDNI",
    "Description": "Hey guys, here is the history of the Nissan GTR. It is one of Japan\u0027s most iconic cars...also known as Godzilla. The GTR was originally a Skyline and eventually went onto it\u0027s own model. I know I\u0027ve missed other variations of the GTR, but tried to squeeze as much information to as close to 10minutes as possible. Let me know what you think."
  },
  {
    "Title": "Mitsubishi Lancer Evolution History : Everything YOU need to know!",
    "Url": "https://www.youtube.com/watch?v=rF0gIeww6q4",
    "Description": "The Mitsubishi Lancer Evolution has been discontinued, but it\u0027s past was very interesting. The rally inspired Lancer Evolution evolved through many obstacles and gained a large following while doing it. It\u0027s rally bred history has provided us with a car that\u0027s also very capable on the street. Even though it is gone now, it is not forgotten. Maybe we\u0027ll get another form of the \u0022Evolution\u0022 in future Mitsubishi models. Hope you enjoy watching the history of the Mitsubishi Lancer Evolution! "
  },
  {
    "Title": "Mazda RX7 History : Everything YOU need to know!",
    "Url": "https://www.youtube.com/watch?v=cMF3C7TWIzw",
    "Description": "The Mazda RX7 is one of the Japanese supercar manufacturers, but with a twist. It\u0027s powered by a rotary engine which makes it unique and provides great power potential out of it\u0027s small displacement. How did the RX7 come to fruition though? This video will be on the history of the RX7."
  },
  {
    "Title": "Toyota Supra History : Everything YOU need to know!",
    "Url": "https://www.youtube.com/watch?v=vaYrlLcNLxg",
    "Description": "The Supra has always been one of many dream cars of mine. Most would only recognize it by the last generation MKIV Supra, but there were others before it. Here is a brief Toyota Supra History video."
  },
  {
    "Title": "Subaru Impreza WRX \u0026 STI History : Everything YOU need to know!",
    "Url": "https://www.youtube.com/watch?v=mFXWs6cvMoI",
    "Description": "This video explores the history of the Subaru Impreza WRX and STI, tracing their evolution from rally cars to street-legal performance vehicles. The video covers the development of the boxer engine and all-wheel drive system, the car\u0027s involvement in the World Rally Championship, and the various generations of the WRX and STI."
  },
  {
    "Title": "Honda/Acura NSX History : Everything YOU need to know!",
    "Url": "https://www.youtube.com/watch?v=tuUrQKSCDas\u0026list=PLcKm5yGwPwVZd-hTuBmXPPIQ-VGQnNVug\u0026index=16",
    "Description": "Here a history on the Honda\u0027s supercar the NSX! I know it\u0027s only been through two generations, but it\u0027s been a long 1st generation and there were many obstacles. The 2nd generation wasn\u0027t as smooth as well. Enjoy the video!"
  },
  {
    "Title": "History of Lamborghini Documentary",
    "Url": "https://www.youtube.com/watch?v=wjjt_zhBKaw",
    "Description": "History of the brand Lamborghini, by Discovery documentary"
  },
  {
    "Title": "Toyota AE86: You Know The Name But Do You Know The Car?",
    "Url": "https://www.youtube.com/watch?v=blFur7piEnI",
    "Description": "It’s known as the AE86, the Trueno, the eight-six, but one thing is certain: There is no car more iconic in anime and in drifting than the Toyota Corolla AE86. The actual Drift King in Japan drove one, it’s the reason many of us got into drifting, and today we get to go Bumper 2 Bumper on one!"
  },
  {
    "Title": "Evolution Of The Bargain Supercar - Audi R8 2003 - 2021",
    "Url": "https://www.youtube.com/watch?v=v2DD37qoqzc",
    "Description": "The Audi R8 is the do everything supercar! It\u0027s one of the cheapest supercars, it\u0027s a reliable supercar and it\u0027s a FAST supercar! We break down the evolution of the Audi R8 supercar and go through each generation, V8 or V10, how it\u0027s changed and what inspired it!"
  },
  {
    "Title": "Time for TT - The Audi TT Story",
    "Url": "https://www.youtube.com/watch?v=_406lq7T3EY",
    "Description": "The Audi TT is in my opinion one of the best styled cars in the past 30 years. And I’ve put my money where my mouth is – I owned one for 9 years. I loved every minute, even taking it around the track. But I’m waiting for the next car with a style so unique that I’ve just got to own it. It’s a car that’s spanned four decades through three different guises and ended production in November 2023. So, just where did the inspiration for the TT come from, what disaster struck just after it launched and did the second and third generation improve on the TT formula?"
  },
  {
    "Title": "So You Want an Audi S4",
    "Url": "https://www.youtube.com/watch?v=Kc1jxdwITGw",
    "Description": "Turbocharged, supercharged, naturally aspirated V8, the Audi S4 has seen it all throughout its lifetime. Made famous by its Quattro AWD system the S4 has become a favorite among European car enthusiasts. From the starting days of the C4, to the iconic B5, to today\u0027s B9, join Alex as he breaks down what you should expect if you plan to pick up one of these angry-sounding AWD Audi sedans. "
  },
  {
    "Title": "Quicker Than a McLaren F1: The Audi RS2 — BTS with DTS — Ep. 12",
    "Url": "https://www.youtube.com/watch?v=yAr-_p-m3gc",
    "Description": "The Audi RS2 represented the final step in Audi’s transition to becoming a full-fledged performance marque that could compete with BMW and Mercedes. After lying dormant for decades, the Audi name was resurrected as part of the Volkswagen group in 1965 and produced…rather conventional cars. In 1972, Ferdinand Piëch joined the company and set about turning Audi’s products around with a focus on technical innovation. By joining a groundbreaking turbocharged 5-cylinder engine with the now iconic quattro all wheel drive system, Piëch and his engineers created not just a series of motorsport coups, but genuinely covetable road cars as well.\r\nThe RS2 is among the most desirable of all, combining the superb competition-bred powertrain that drove almost all of Audi’s racing success with Porsche-engineered upgrades to create the first ever Audi RS car. In this video, Derek Tam-Scott traces the history of Audi RS2 and gets behind the wheel to discover its true character."
  },
  {
    "Title": "Audi RS4 (B7) Review | Is it the ultimate RS?",
    "Url": "https://www.youtube.com/watch?v=mhkfF593jLs",
    "Description": "The B7 Audi RS4 will always be remembered as a pivotal moment in the brand’s performance car history. Ditching the turbocharged setup that was a hallmark of previous fast Audis was a brave call, but one that undoubtedly paid off. \r\nFor under the bonnet of this sensible looking estate was, perhaps, one of the greatest engines ever made. A 4.2-litre naturally aspirated V8 developing 414bhp, it would take the fight to another N/A monsters from both BMW and Mercedes-Benz. But, would it be the ultimate RS? \r\nWatch as James Dennison finds out. "
  },
  {
    "Title": "The Supercar-Killing Audi RS6 Avant We Should\u0027ve Had in America. | 444HP Sleeper",
    "Url": "https://www.youtube.com/watch?v=HCfMIQBJzaM",
    "Description": "You\u0027re looking at one of the most powerful and important Audi RS products of the early 2000s. The Avant of this generation (C5) was never sold on this side of the Atlantic, so naturally the one I\u0027m driving today is a Japanese import because who wants to settle for four doors when you can have five! Under the hood is a twin-turbo 4.2L V8 pushing 444 hp. Truly an epic Audi that no one is talking about. "
  }
]